// Задача №2

// Создать массив на 10 произвольных целых чисел.
// Вывести на экран элементы массива.

// Этапы решения:
// 1. Создание массива
// 2. Проход по элементам
// 3. Проверка каждого элемента на четность
// 4. Вывод подходящего элемента

int n = 10;
int[] array = { 1, 5, 7, 2, 6, 15, 4, 9, 12, 3 };
int i = 0;

while(i <n)
{
    if(array[i] % 2 == 0)
    {
        Console.WriteLine($"{array[i]} ");
    }
    i = i + 1;
}

